src/Catalogs/рдв_ВыгружаемыеОбъекты/рдв_ВыгружаемыеОбъекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рдв_ВыгружаемыеОбъекты</name>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.рдв_ТипыВыгружаемыхОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>125</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Успешно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>125</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Входящий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСообщения</name>
    <type>
      <types>CatalogRef.рдв_ВидыСообщенийИнтеграции</types>
    </type>
  </attributes>
  <attributes>
    <name>Замещение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтборНабораЗаписей</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборЗаписей</name>
    <attributes>
      <name>НомерЗаписи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/рдв_ВыгружаемыеОбъекты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СоздатьОбновитьВыгружаемыйОбъект(Источник = Неопределено, ИдентификаторДанных = Неопределено
										, ВыгружаемыйОбъект = Неопределено, Входящий = Ложь
										, Замещение = Неопределено) Экспорт
	
	Возврат СоздатьОбновить(Источник, ИдентификаторДанных, ВыгружаемыйОбъект, Входящий, Замещение);
	
КонецФункции

Функция ВыгружаемыйОбъект(Источник, ИдентификаторДанных = Неопределено) Экспорт
	
	Описание = ОписаниеИсточника(Источник);
	
	Возврат СуществующийОбъект(Описание);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьОбновить(Источник, ИдентификаторДанных, ВыгружаемыйОбъект = Неопределено, Входящий = Ложь, Замещение = Неопределено)
	
	Описание = ОписаниеИсточника(Источник, ИдентификаторДанных, ,,,Замещение);
	Если Описание = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ВыгружаемыйОбъект = Неопределено Тогда

		ЗаписьБД = СуществующийОбъект(Описание);
		Если Не ЗаписьБД = Неопределено Тогда
//			ОбновитьЗапись(ЗаписьБД);
			Возврат ЗаписьБД;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВыгружаемыйОбъект = Неопределено Тогда
		НовыйОбъект = СоздатьЭлемент();
	Иначе
		НовыйОбъект = ВыгружаемыйОбъект.ПолучитьОбъект();
		Если НовыйОбъект = Неопределено Тогда
			НовыйОбъект  = СоздатьЭлемент();
			НовыйОбъект.УстановитьСсылкуНового(ВыгружаемыйОбъект);
		КонецЕсли;
	КонецЕсли;
	НовыйОбъект.Заполнить(Описание);
	НовыйОбъект.Входящий = Входящий;
	НовыйОбъект.ДополнительныеСвойства.Вставить(рдв_ХешиОбъектов.ХешСвойствоОтказатьсяОтРасчета(), Истина);
	НовыйОбъект.Записать();
	
	Возврат НовыйОбъект.Ссылка;
	
КонецФункции

Функция СоздатьВыгружаемыйОбъектПодтверждениеПолучения(ИдентификаторСообщения, ЗагружаемыеДанные = Неопределено, ВидСообщения = Неопределено) Экспорт

	Описание = ОписаниеИсточника(ЗагружаемыеДанные, , ИдентификаторСообщения, Перечисления.рдв_ТипыВыгружаемыхОбъектов.ПодтверждениеПолучения, ВидСообщения);
	
	ЗаписьБД = СуществующийОбъект(Описание);
	Если Не ЗаписьБД = Неопределено Тогда
//		ОбновитьЗапись(ЗаписьБД);
		Возврат ЗаписьБД;
	КонецЕсли;
	
	НовыйОбъект = СоздатьЭлемент();
	НовыйОбъект.Заполнить(Описание);
	НовыйОбъект.ДополнительныеСвойства.Вставить(рдв_ХешиОбъектов.ХешСвойствоОтказатьсяОтРасчета(), Истина);
	НовыйОбъект.Записать();
	Возврат НовыйОбъект.Ссылка;
	
КонецФункции

Функция СоздатьВыгружаемыйОбъектДиагностики() Экспорт

	ИдентификаторДанных = "ping";
	ИдентификаторСообщения = Неопределено;
	ЗагружаемыеДанные = Неопределено;
	Описание = ОписаниеИсточника(ЗагружаемыеДанные, ИдентификаторДанных, ИдентификаторСообщения, Перечисления.рдв_ТипыВыгружаемыхОбъектов.Произвольный);
	
	ЗаписьБД = СуществующийОбъект(Описание);
	Если Не ЗаписьБД = Неопределено Тогда
//		ОбновитьЗапись(ЗаписьБД);
		Возврат ЗаписьБД;
	КонецЕсли;
	
	НовыйОбъект = СоздатьЭлемент();
	НовыйОбъект.Заполнить(Описание);
	НовыйОбъект.ДополнительныеСвойства.Вставить(рдв_ХешиОбъектов.ХешСвойствоОтказатьсяОтРасчета(), Истина);
	НовыйОбъект.Записать();
	Возврат НовыйОбъект.Ссылка;
	
КонецФункции


//Функция ОбновитьВыгружаемыйОбъектПодтверждениеПолучения(ИдентификаторСообщения, ЗагружаемыеДанные) Экспорт
//
//	Описание = ОписаниеИсточника(Неопределено, , ИдентификаторСообщения, Перечисления.рдв_ТипыВыгружаемыхОбъектов.ПодтверждениеПолучения);
//	
//	ЗаписьБД = СуществующийОбъект(Описание);
//	
//	Описание = ОписаниеИсточника(ЗагружаемыеДанные, , ИдентификаторСообщения, Перечисления.рдв_ТипыВыгружаемыхОбъектов.ПодтверждениеПолучения);
//	
//	Если ЗаписьБД = Неопределено Тогда
//		ЗаписьБД = СуществующийОбъект(Описание);	
//	КонецЕсли;
//	
//	ЗаписьБДОбъект = ЗаписьБД.ПолучитьОбъект();
//	ЗаписьБДОбъект.Заполнить(Описание);
//	ЗаписьБДОбъект.Записать();
//	Возврат ЗаписьБДОбъект.Ссылка;
//	
//КонецФункции

Функция СуществующийОбъект(Описание)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВыгружаемыеОбъекты.Ссылка
	|ИЗ
	|	Справочник.рдв_ВыгружаемыеОбъекты КАК ВыгружаемыеОбъекты
	|ГДЕ
	|	ВыгружаемыеОбъекты.ХешСумма = &ХешСумма
	|	И ВыгружаемыеОбъекты.Тип = &Тип
	|	И ВыгружаемыеОбъекты.ИдентификаторДанных = &ИдентификаторДанных
	|	И ВыгружаемыеОбъекты.СсылкаНаОбъект = &СсылкаНаОбъект";
	Запрос.УстановитьПараметр("ХешСумма"			, Описание.ХешСумма);
	Запрос.УстановитьПараметр("Тип"					, Описание.Тип);
	Запрос.УстановитьПараметр("ИдентификаторДанных"	, Описание.ИдентификаторДанных);
	Запрос.УстановитьПараметр("СсылкаНаОбъект"		, Описание.СсылкаНаОбъект);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции

Функция ОписаниеОбъекта() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ХешСумма", "");
	Результат.Вставить("Тип", Перечисления.рдв_ТипыВыгружаемыхОбъектов.ПустаяСсылка());
	Результат.Вставить("СсылкаНаОбъект", Неопределено);
	Результат.Вставить("ИдентификаторДанных", "");
	Результат.Вставить("ИдентификаторСообщения", "");
	Результат.Вставить("ВидСообщения", "");
	Результат.Вставить("Замещение", "");
	ТЗ = Новый ТаблицаЗначений();
	ТЗ.Колонки.Добавить("Имя", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТЗ.Колонки.Добавить("Значение");
	Результат.Вставить("ОтборНабораЗаписей", ТЗ);
	ТЗ = Новый ТаблицаЗначений();
	ТЗ.Колонки.Добавить("НомерЗаписи", ОбщегоНазначения.ОписаниеТипаЧисло(0));
	ТЗ.Колонки.Добавить("Имя", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТЗ.Колонки.Добавить("Значение");
	Результат.Вставить("НаборЗаписей", ТЗ);
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеИсточника(Источник = Неопределено, ИдентификаторДанных = Неопределено,
									ИдентификаторСообщения = Неопределено, Тип = Неопределено,
									ВидСообщения = Неопределено, Замещение = Неопределено)
	
	Описание = ОписаниеОбъекта();
	
	Если Источник = Неопределено И ИдентификаторСообщения = Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(ИдентификаторДанных) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Описание.Тип = Перечисления.рдв_ТипыВыгружаемыхОбъектов.Произвольный;
		
		Описание.ИдентификаторДанных = ИдентификаторДанных;
		
	ИначеЕсли Источник = Неопределено И НЕ ИдентификаторСообщения = Неопределено Тогда
		Описание.ИдентификаторСообщения = ИдентификаторСообщения;
	Иначе
		МетаданныеИсточника = Источник.Метаданные();
		ИмяМетаданных = МетаданныеИсточника.ПолноеИмя();
		Если Лев(ИмяМетаданных, 7) = "Регистр" Тогда
			
			Если НЕ МетаданныеИсточника = Метаданные.РегистрыСведений.рдв_СообщенияИнтеграции Тогда
				Описание.Тип = Перечисления.рдв_ТипыВыгружаемыхОбъектов.НаборЗаписей;
				Описание.ИдентификаторДанных = ИмяМетаданных;
				Для Каждого ЭлементОтбора Из Источник.Отбор Цикл
					Если ЭлементОтбора.Использование = Ложь Тогда
						Продолжить;
					КонецЕсли;
					НоваяСтрока = Описание.ОтборНабораЗаписей.Добавить();
					НоваяСтрока.Имя = ЭлементОтбора.Имя;
					НоваяСтрока.Значение = ЭлементОтбора.Значение;
				КонецЦикла;
				Если ТипЗнч(Замещение) = Тип("Булево") Или
					Замещение = Неопределено Тогда
				Иначе
					Описание.Замещение = Замещение;
					ТаблицаРегистра = Источник.ВыгрузитьКолонки();
					НомерСтроки = 0;
					Для Каждого Запись Из Источник Цикл
						НомерСтроки = НомерСтроки + 1;
						Для Каждого Колонка Из ТаблицаРегистра.Колонки Цикл
							НоваяСтрока = Описание.НаборЗаписей.Добавить();
							НоваяСтрока.НомерЗаписи = НомерСтроки;
							НоваяСтрока.Имя = Колонка.Имя;
							НоваяСтрока.Значение = Запись[Колонка.Имя];
						КонецЦикла;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Источник)) Тогда
				СсылкаНаОбъект = Источник;
			Иначе
				СсылкаНаОбъект = Источник.Ссылка;
			КонецЕсли;
			
			Описание.Тип = Перечисления.рдв_ТипыВыгружаемыхОбъектов.Ссылка;
			Описание.ИдентификаторДанных = ИмяМетаданных;
			Описание.СсылкаНаОбъект = СсылкаНаОбъект;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Не Тип = Неопределено Тогда
		Описание.Тип = Тип;
	КонецЕсли;
	
	Описание.ИдентификаторСообщения = ИдентификаторСообщения;
	Описание.ВидСообщения = ВидСообщения;
	Хеш = рдв_ХешиОбъектов.ХешСтандартныйКоллекции(Описание);
	Описание.ХешСумма = Хеш;
	
	Возврат Описание;
	
КонецФункции

Процедура ОбновитьЗапись(ЗаписьБД)
	
	рдв_ХешиОбъектов.ХешСтандартныйОбъекта(ЗаписьБД,, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
